<template>
  <div class="bg-light p-10 ">
    <div class="container-fluid p-2">
      <div class="row">
        <div class="col-lg-8">
          <div class="place-img">
            <img src="/images/adsdetails.jpg" alt="">
            <div class="bg-white catigory-span">
              <span>فئة 2</span>
            </div>
            <div class="d-flex justify-content-center small-img-parent w-100">
              <div class="small-image">
                <img src="/images/one.png" alt="">
              </div>
              <div class="small-image">
                <img src="/images/two.png" alt="">
              </div>
              <div class="small-image">
                <img src="/images/three.png" alt="">
              </div>
              <div class="small-image">
                <img src="/images/four.png" alt="">
              </div>
            </div>
          </div>
          <div class="d-flex justify-content-between p-2">
            <h4>اسم المكان</h4>
            <h4 class="price-card">240,000</h4>
          </div>
          <div class="gray-text card-deatails p-2">
            <p class="pb-3">
              <span><svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M0.687622 7.875C0.687622 3.7728 3.9827 0.9375 8.00012 0.9375C12.0175 0.9375 15.3126 3.7728 15.3126 7.875C15.3126 11.0032 13.9134 13.2998 12.3243 14.8042C11.5319 15.5545 10.6884 16.1121 9.93743 16.4843C9.20504 16.8474 8.50317 17.0624 8.00012 17.0624C7.49708 17.0624 6.79521 16.8474 6.06281 16.4843C5.31181 16.1121 4.46833 15.5545 3.6759 14.8042C2.08682 13.2998 0.687622 11.0032 0.687622 7.875ZM8.00026 10.5C9.2429 10.5 10.2503 9.49264 10.2503 8.25C10.2503 7.00736 9.2429 6 8.00026 6C6.75762 6 5.75026 7.00736 5.75026 8.25C5.75026 9.49264 6.75762 10.5 8.00026 10.5Z"
                    fill="#8E8E93" />
                </svg>
              </span>
              <span>لمكان الأساسي, المكان الفرعي, تفاصيل المكان</span>
            </p>
            <div class="d-flex justify-content-between flex-wrap gap-3 ">
              <p>
                <span>المساحه</span>
                <span class="px-2"><svg width="18" height="18" viewBox="0 0 18 18" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M7.5 3C7.5 3.19891 7.42098 3.38968 7.28033 3.53033C7.13968 3.67098 6.94891 3.75 6.75 3.75H4.8075L6.5325 5.4675C6.67373 5.60873 6.75307 5.80027 6.75307 6C6.75307 6.19973 6.67373 6.39127 6.5325 6.5325C6.39127 6.67373 6.19973 6.75307 6 6.75307C5.80027 6.75307 5.60873 6.67373 5.4675 6.5325L3.75 4.8075V6.75C3.75 6.94891 3.67098 7.13968 3.53033 7.28033C3.38968 7.42098 3.19891 7.5 3 7.5C2.80109 7.5 2.61032 7.42098 2.46967 7.28033C2.32902 7.13968 2.25 6.94891 2.25 6.75V3C2.25083 2.80325 2.32894 2.6147 2.4675 2.475V2.475C2.53696 2.40413 2.61979 2.34776 2.7112 2.30913C2.80261 2.27051 2.90077 2.25041 3 2.25H6.75C6.94891 2.25 7.13968 2.32902 7.28033 2.46967C7.42098 2.61032 7.5 2.80109 7.5 3ZM6.75 14.25H4.8075L6.5325 12.5325C6.67373 12.3913 6.75307 12.1997 6.75307 12C6.75307 11.8003 6.67373 11.6087 6.5325 11.4675C6.39127 11.3263 6.19973 11.2469 6 11.2469C5.80027 11.2469 5.60873 11.3263 5.4675 11.4675L3.75 13.1925V11.25C3.75 11.0511 3.67098 10.8603 3.53033 10.7197C3.38968 10.579 3.19891 10.5 3 10.5C2.80109 10.5 2.61032 10.579 2.46967 10.7197C2.32902 10.8603 2.25 11.0511 2.25 11.25V15C2.25083 15.1968 2.32894 15.3853 2.4675 15.525V15.525C2.53661 15.5925 2.61811 15.6459 2.7075 15.6825C2.79945 15.7245 2.89895 15.7474 3 15.75H6.75C6.94891 15.75 7.13968 15.671 7.28033 15.5303C7.42098 15.3897 7.5 15.1989 7.5 15C7.5 14.8011 7.42098 14.6103 7.28033 14.4697C7.13968 14.329 6.94891 14.25 6.75 14.25ZM15.69 2.715C15.6534 2.62561 15.6 2.54411 15.5325 2.475V2.475C15.463 2.40413 15.3802 2.34776 15.2888 2.30913C15.1974 2.27051 15.0992 2.25041 15 2.25H11.25C11.0511 2.25 10.8603 2.32902 10.7197 2.46967C10.579 2.61032 10.5 2.80109 10.5 3C10.5 3.19891 10.579 3.38968 10.7197 3.53033C10.8603 3.67098 11.0511 3.75 11.25 3.75H13.1925L11.4675 5.4675C11.3263 5.60873 11.2469 5.80027 11.2469 6C11.2469 6.19973 11.3263 6.39127 11.4675 6.5325C11.6087 6.67373 11.8003 6.75307 12 6.75307C12.1997 6.75307 12.3913 6.67373 12.5325 6.5325L14.25 4.8075V6.75C14.25 6.94891 14.329 7.13968 14.4697 7.28033C14.6103 7.42098 14.8011 7.5 15 7.5C15.1989 7.5 15.3897 7.42098 15.5303 7.28033C15.671 7.13968 15.75 6.94891 15.75 6.75V3C15.7488 2.90199 15.7284 2.80517 15.69 2.715ZM15 10.5C14.8011 10.5 14.6103 10.579 14.4697 10.7197C14.329 10.8603 14.25 11.0511 14.25 11.25V13.1925L12.5325 11.4675C12.4626 11.3976 12.3796 11.3421 12.2882 11.3043C12.1968 11.2664 12.0989 11.2469 12 11.2469C11.9011 11.2469 11.8032 11.2664 11.7118 11.3043C11.6204 11.3421 11.5374 11.3976 11.4675 11.4675C11.3976 11.5374 11.3421 11.6204 11.3043 11.7118C11.2664 11.8032 11.2469 11.9011 11.2469 12C11.2469 12.1997 11.3263 12.3913 11.4675 12.5325L13.1925 14.25H11.25C11.0511 14.25 10.8603 14.329 10.7197 14.4697C10.579 14.6103 10.5 14.8011 10.5 15C10.5 15.1989 10.579 15.3897 10.7197 15.5303C10.8603 15.671 11.0511 15.75 11.25 15.75H15C15.0955 15.7479 15.1897 15.7275 15.2775 15.69C15.4608 15.6139 15.6064 15.4683 15.6825 15.285C15.7235 15.1954 15.7464 15.0985 15.75 15V15V11.25C15.75 11.0511 15.671 10.8603 15.5303 10.7197C15.3897 10.579 15.1989 10.5 15 10.5Z"
                      fill="#2E637F" />
                  </svg>
                </span>
                <span class="caded-blue">245 م</span>
              </p>
              <p>
                <span>عدد الغرف</span>
                <span class="px-2"><svg width="18" height="18" viewBox="0 0 18 18" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M14.16 7.5H6.75V6.93C6.75 6.28552 6.49398 5.66744 6.03827 5.21173C5.58256 4.75602 4.96448 4.5 4.32 4.5H3V2.25C3 2.05109 2.92098 1.86032 2.78033 1.71967C2.63968 1.57902 2.44891 1.5 2.25 1.5C2.05109 1.5 1.86032 1.57902 1.71967 1.71967C1.57902 1.86032 1.5 2.05109 1.5 2.25V15C1.5 15.1989 1.57902 15.3897 1.71967 15.5303C1.86032 15.671 2.05109 15.75 2.25 15.75C2.44891 15.75 2.63968 15.671 2.78033 15.5303C2.92098 15.3897 3 15.1989 3 15V14.25H14.25V15C14.25 15.1989 14.329 15.3897 14.4697 15.5303C14.6103 15.671 14.8011 15.75 15 15.75C15.1989 15.75 15.3897 15.671 15.5303 15.5303C15.671 15.3897 15.75 15.1989 15.75 15V14.25H16.5V9.84C16.5 9.53271 16.4395 9.22842 16.3219 8.94452C16.2043 8.66062 16.0319 8.40266 15.8146 8.18537C15.5973 7.96808 15.3394 7.79572 15.0555 7.67812C14.7716 7.56053 14.4673 7.5 14.16 7.5ZM3 6H4.32C4.44241 5.999 4.56379 6.02237 4.67707 6.06876C4.79036 6.11514 4.89328 6.18361 4.97984 6.27016C5.0664 6.35672 5.13486 6.45964 5.18124 6.57293C5.22763 6.68621 5.251 6.80759 5.25 6.93V7.5H3V6ZM3 12.75V9H14.16C14.3828 9 14.5964 9.0885 14.754 9.24603C14.9115 9.40356 15 9.61722 15 9.84V12.75H3Z"
                      fill="#2E637F" />
                    <path
                      d="M13.5 10.5H6.75C6.55109 10.5 6.36032 10.579 6.21967 10.7197C6.07902 10.8603 6 11.0511 6 11.25C6 11.4489 6.07902 11.6397 6.21967 11.7803C6.36032 11.921 6.55109 12 6.75 12H13.5C13.6989 12 13.8897 11.921 14.0303 11.7803C14.171 11.6397 14.25 11.4489 14.25 11.25C14.25 11.0511 14.171 10.8603 14.0303 10.7197C13.8897 10.579 13.6989 10.5 13.5 10.5Z"
                      fill="#2E637F" />
                  </svg>
                </span>
                <span class="caded-blue">2</span>
              </p>
              <p>
                <span>عرض الشارع</span>
                <span class="px-2"><svg width="18" height="18" viewBox="0 0 18 18" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M8.0325 11.0325L5.5575 13.5H7.5C7.69891 13.5 7.88968 13.579 8.03033 13.7197C8.17098 13.8603 8.25 14.0511 8.25 14.25C8.25 14.4489 8.17098 14.6397 8.03033 14.7803C7.88968 14.921 7.69891 15 7.5 15H3.75C3.65452 14.9979 3.56034 14.9775 3.4725 14.94C3.38311 14.9034 3.30161 14.85 3.2325 14.7825C3.16028 14.7137 3.10251 14.6311 3.06259 14.5397C3.02266 14.4482 3.00139 14.3498 3 14.25V10.5C3 10.3011 3.07902 10.1103 3.21967 9.96967C3.36032 9.82902 3.55109 9.75 3.75 9.75C3.94891 9.75 4.13968 9.82902 4.28033 9.96967C4.42098 10.1103 4.5 10.3011 4.5 10.5V12.4425L6.9675 9.9675C7.10873 9.82627 7.30027 9.74693 7.5 9.74693C7.69973 9.74693 7.89127 9.82627 8.0325 9.9675C8.17373 10.1087 8.25307 10.3003 8.25307 10.5C8.25307 10.6997 8.17373 10.8913 8.0325 11.0325ZM14.94 3.465C14.9034 3.37561 14.85 3.29411 14.7825 3.225C14.713 3.15413 14.6302 3.09776 14.5388 3.05913C14.4474 3.02051 14.3492 3.00041 14.25 3H10.5C10.3011 3 10.1103 3.07902 9.96967 3.21967C9.82902 3.36032 9.75 3.55109 9.75 3.75C9.75 3.94891 9.82902 4.13968 9.96967 4.28033C10.1103 4.42098 10.3011 4.5 10.5 4.5H12.4425L9.9675 6.9675C9.82627 7.10873 9.74693 7.30027 9.74693 7.5C9.74693 7.69973 9.82627 7.89127 9.9675 8.0325C10.1087 8.17373 10.3003 8.25307 10.5 8.25307C10.6997 8.25307 10.8913 8.17373 11.0325 8.0325L13.5 5.5575V7.5C13.5 7.69891 13.579 7.88968 13.7197 8.03033C13.8603 8.17098 14.0511 8.25 14.25 8.25C14.4489 8.25 14.6397 8.17098 14.7803 8.03033C14.921 7.88968 15 7.69891 15 7.5V3.75C14.9988 3.65199 14.9784 3.55517 14.94 3.465Z"
                      fill="#2E637F" />
                  </svg>
                </span>
                <span class="caded-blue">6 م</span>
              </p>
              <p>
                <span> الصالات</span>
                <span class="px-2"><svg width="20" height="17" viewBox="0 0 20 17" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M17 5.875V3.25C17 2.78587 16.8156 2.34075 16.4874 2.01256C16.1592 1.68437 15.7141 1.5 15.25 1.5H4.75C4.28587 1.5 3.84075 1.68437 3.51256 2.01256C3.18437 2.34075 3 2.78587 3 3.25V5.875M17 5.875C17.4641 5.875 17.9093 6.05938 18.2374 6.38756C18.5656 6.71575 18.75 7.16087 18.75 7.625V12C18.75 12.4641 18.5656 12.9092 18.2374 13.2374C17.9093 13.5656 17.4641 13.75 17 13.75M17 5.875C16.5359 5.875 16.0908 6.05938 15.7626 6.38756C15.4344 6.71575 15.25 7.16087 15.25 7.625V9.375H4.75V7.625C4.75 7.16087 4.56563 6.71575 4.23744 6.38756C3.90925 6.05938 3.46413 5.875 3 5.875M3 5.875C2.53587 5.875 2.09075 6.05938 1.76256 6.38756C1.43437 6.71575 1.25 7.16087 1.25 7.625V12C1.25 12.4641 1.43437 12.9092 1.76256 13.2374C2.09075 13.5656 2.53587 13.75 3 13.75M3 13.75H17M3 13.75V15.5M17 13.75V15.5M10 1.5V9.375"
                      stroke="#2E637F" stroke-width="1.75" stroke-linecap="round" stroke-linejoin="round" />
                  </svg>

                </span>
                <span class="caded-blue">6 </span>
              </p>
              <p>
                <span>رقم الدور</span>
                <span class="px-2">
                  <svg width="21" height="17" viewBox="0 0 21 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M15.75 15.5V3.25C15.75 2.78587 15.5656 2.34075 15.2374 2.01256C14.9092 1.68437 14.4641 1.5 14 1.5H7C6.53587 1.5 6.09075 1.68437 5.76256 2.01256C5.43437 2.34075 5.25 2.78587 5.25 3.25V15.5M1.75 15.5H19.25M12.25 8.5V8.50875"
                      stroke="#2E637F" stroke-width="1.75" stroke-linecap="round" stroke-linejoin="round" />
                  </svg>

                </span>
                <span class="caded-blue">1 علوى</span>
              </p>
            </div>
            <p class="mt-3 resopnsive-p">
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك
              أن تولد مثل هذا النص أو العديد من النصوص هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد
              هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص هذا النص هو مثال لنص يمكن
              أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل
            </p>
          </div>
          <div class="chat-circle" @click="toggleSoro">
            <p><svg width="30" height="30" viewBox="0 0 37 37" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M33.9166 9.63558V17.498C33.9166 19.456 33.2691 21.1056 32.1128 22.2464C30.972 23.4027 29.3224 24.0501 27.3645 24.0501V26.8405C27.3645 27.8889 26.1928 28.521 25.3295 27.9352L23.8341 26.9485C23.9728 26.4706 24.0345 25.9464 24.0345 25.3914V19.1169C24.0345 15.9719 21.9378 13.8752 18.7928 13.8752H8.32491C8.10908 13.8752 7.90867 13.8906 7.70825 13.906V9.63558C7.70825 5.70433 10.3291 3.0835 14.2603 3.0835H27.3645C31.2958 3.0835 33.9166 5.70433 33.9166 9.63558Z"
                  stroke="white" stroke-width="2.3125" stroke-miterlimit="10" stroke-linecap="round"
                  stroke-linejoin="round" />
                <path
                  d="M24.0345 19.1167V25.3912C24.0345 25.9462 23.9728 26.4704 23.8341 26.9483C23.2637 29.2146 21.3828 30.6329 18.7928 30.6329H14.5995L9.94366 33.7317C9.24991 34.2096 8.32491 33.7008 8.32491 32.8683V30.6329C6.75241 30.6329 5.44201 30.1088 4.53242 29.1992C3.60742 28.2742 3.08325 26.9637 3.08325 25.3912V19.1167C3.08325 16.1875 4.90242 14.1679 7.70825 13.9059C7.90867 13.8904 8.10908 13.875 8.32491 13.875H18.7928C21.9378 13.875 24.0345 15.9717 24.0345 19.1167Z"
                  stroke="white" stroke-width="2.3125" stroke-miterlimit="10" stroke-linecap="round"
                  stroke-linejoin="round" />
              </svg>
            </p>
            <span>محادثة</span>
          </div>
          <div class="chats-box" v-show="isSoroVisible">
            <div class="notify-section">
              <div class="d-flex justify-content-between">
                <div class="d-flex">
                  <img src="/images/Rectangle 3.png" alt="" />
                  <div class="pe-3">
                    <p class="m-0 text-bold">عبدالرحمن أحمد علي</p>
                    <p class="m-0 gray-text">يريد حجز العقار X</p>
                  </div>
                </div>
                <div class="notification-time">
                  <span>منذ ساعة</span>
                </div>
              </div>
            </div>
            <div class="notify-section">
              <div class="d-flex justify-content-between">
                <div class="d-flex">
                  <img src="/images/Rectangle 3.png" alt="" />
                  <div class="pe-3">
                    <p class="m-0 text-bold">عبدالرحمن أحمد علي</p>
                    <p class="m-0 gray-text">يريد حجز العقار X</p>
                  </div>
                </div>
                <div class="notification-time">
                  <span>منذ ساعة</span>
                </div>
              </div>
            </div>
            <div class="notify-section">
              <div class="d-flex justify-content-between">
                <div class="d-flex">
                  <img src="/images/Rectangle 3.png" alt="" />
                  <div class="pe-3">
                    <p class="m-0 text-bold">عبدالرحمن أحمد علي</p>
                    <p class="m-0 gray-text">يريد حجز العقار X</p>
                  </div>
                </div>
                <div class="notification-time">
                  <span>منذ ساعة</span>
                </div>
              </div>
            </div>
          </div>
        </div>
        <div class="col-lg-4">
          <div class="d-flex justify-content-between gap-2">
            <button class="btn btn-success px-lg-4 px-2">
              <span class="ps-2">تعديل</span>
              <span><svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M9.79163 2.25H8.04163C3.66663 2.25 1.91663 4 1.91663 8.375V13.625C1.91663 18 3.66663 19.75 8.04163 19.75H13.2916C17.6666 19.75 19.4166 18 19.4166 13.625V11.875"
                    stroke="white" stroke-width="1.3125" stroke-linecap="round" stroke-linejoin="round" />
                  <path
                    d="M14.2016 3.14211L7.30664 10.0371C7.04414 10.2996 6.78164 10.8159 6.72914 11.1921L6.35289 13.8259C6.21289 14.7796 6.88664 15.4446 7.84039 15.3134L10.4741 14.9371C10.8416 14.8846 11.3579 14.6221 11.6291 14.3596L18.5241 7.46461C19.7141 6.27461 20.2741 4.89211 18.5241 3.14211C16.7741 1.39211 15.3916 1.95211 14.2016 3.14211Z"
                    stroke="white" stroke-width="1.3125" stroke-miterlimit="10" stroke-linecap="round"
                    stroke-linejoin="round" />
                  <path d="M13.2129 4.13135C13.7991 6.2226 15.4354 7.85885 17.5354 8.45385" stroke="white"
                    stroke-width="1.3125" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round" />
                </svg>
              </span>
            </button>
            <button class="btn btn-danger  px-lg-4 px-2">
              <span class="ps-2">حذف </span>
              <span><svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M18.875 5.73242C15.9613 5.44367 13.03 5.29492 10.1075 5.29492C8.375 5.29492 6.6425 5.38242 4.91 5.55742L3.125 5.73242"
                    stroke="white" stroke-width="1.3125" stroke-linecap="round" stroke-linejoin="round" />
                  <path
                    d="M7.9375 4.84875L8.13 3.7025C8.27 2.87125 8.375 2.25 9.85375 2.25H12.1463C13.625 2.25 13.7388 2.90625 13.87 3.71125L14.0625 4.84875"
                    stroke="white" stroke-width="1.3125" stroke-linecap="round" stroke-linejoin="round" />
                  <path
                    d="M16.9937 8.49756L16.425 17.3088C16.3287 18.6826 16.25 19.7501 13.8087 19.7501H8.19123C5.74998 19.7501 5.67123 18.6826 5.57498 17.3088L5.00623 8.49756"
                    stroke="white" stroke-width="1.3125" stroke-linecap="round" stroke-linejoin="round" />
                  <path d="M9.5387 14.9375H12.4524" stroke="white" stroke-width="1.3125" stroke-linecap="round"
                    stroke-linejoin="round" />
                  <path d="M8.8125 11.4375H13.1875" stroke="white" stroke-width="1.3125" stroke-linecap="round"
                    stroke-linejoin="round" />
                </svg>
              </span>
            </button>

            <button class="btn btn-secondary text-white px-lg-4 px-2"><span class="ps-2">ايقاف</span>
              <span><svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M13.8709 2.25H8.79588C8.20088 2.25 7.36087 2.6 6.94087 3.02L3.35338 6.60751C2.93338 7.02751 2.58337 7.86751 2.58337 8.46251V13.5375C2.58337 14.1325 2.93338 14.9725 3.35338 15.3925L6.94087 18.98C7.36087 19.4 8.20088 19.75 8.79588 19.75H13.8709C14.4659 19.75 15.3059 19.4 15.7259 18.98L19.3134 15.3925C19.7334 14.9725 20.0834 14.1325 20.0834 13.5375V8.46251C20.0834 7.86751 19.7334 7.02751 19.3134 6.60751L15.7259 3.02C15.3059 2.6 14.4659 2.25 13.8709 2.25Z"
                    stroke="white" stroke-width="1.3125" stroke-linecap="round" stroke-linejoin="round" />
                  <path d="M5.15588 17.1948L17.5284 4.82227" stroke="white" stroke-width="1.3125" stroke-linecap="round"
                    stroke-linejoin="round" />
                </svg>
              </span></button>
          </div>

          <!-- <div class="responsive-map3" id="mmap">
            <iframe
              src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2822.7806761080233!2d-93.29138368446431!3d44.96844997909819!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x52b32b6ee2c87c91%3A0xc20dff2748d2bd92!2sWalker+Art+Center!5e0!3m2!1sen!2sus!4v1514524647889"
              frameborder="0" style="border: 0" allowfullscreen></iframe>
            </div> -->
          <div class="mt-3 position-relative">
            <Map></Map>
            <div class="overlay-info d-flex gap-3 p-2">
              <h5>اسم المكان</h5>
              <a href="">عرض كامل للخريطة</a>
            </div>
          </div>


          <p class="fs-6 pt-3">الخدمات المتاحة</p>
          <div class="d-flex gap-4 pt-3">
            <div>
              <div class="options-card1">
                <span><svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M4 11.5H3.5V7H4H4.5V11.5H4ZM17.2782 17.79C17.4441 17.5637 17.6108 17.3673 17.75 17.2141C17.8892 17.3673 18.0559 17.5637 18.2218 17.79C18.6432 18.3646 19 19.0512 19 19.6818C19 20.428 18.4225 21 17.75 21C17.0775 21 16.5 20.428 16.5 19.6818C16.5 19.0512 16.8568 18.3646 17.2782 17.79ZM20 13H20.5V15H14.5V13H15H15.5V12.5V12C15.5 11.1715 14.8285 10.5 14 10.5V6.5H15C17.4853 6.5 19.5 8.5147 19.5 11V12.5V13H20ZM9.5 6.5H12V12H6.5V6.5H8.5H9H9.5Z"
                      fill="#7327EE" stroke="#7327EE" />
                  </svg>
                </span>
              </div>
              <span>مسبح</span>
            </div>
            <div>
              <div class="options-card2">
                <span>
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M2.00005 22C3.25005 21.013 4.27005 20.025 5.90005 19.8C7.31117 19.7997 8.66962 20.3359 9.70005 21.3C10.2348 21.6746 10.8531 21.9126 11.501 21.9933C12.1489 22.0739 12.8067 21.9947 13.4169 21.7626C14.0272 21.5306 14.5713 21.1526 15.0019 20.6618C15.4325 20.171 15.7364 19.5823 15.887 18.947C16.5359 19.0627 17.2041 18.9928 17.815 18.7455C18.4259 18.4981 18.9545 18.0833 19.34 17.5488C19.7255 17.0143 19.9523 16.3818 19.9942 15.7241C20.0362 15.0664 19.8916 14.4102 19.577 13.831C20.1503 13.6458 20.6661 13.3158 21.0744 12.8729C21.4827 12.4299 21.7698 11.8891 21.9079 11.3027C22.046 10.7163 22.0303 10.1042 21.8625 9.52564C21.6947 8.94705 21.3804 8.42157 20.95 8.00004C21.2751 7.67502 21.5329 7.28916 21.7088 6.8645C21.8847 6.43984 21.9752 5.98469 21.9752 5.52504C21.9752 5.06539 21.8847 4.61024 21.7088 4.18558C21.5329 3.76092 21.2751 3.37506 20.95 3.05004C20.625 2.72502 20.2392 2.4672 19.8145 2.2913C19.3898 2.1154 18.9347 2.02486 18.475 2.02486C17.5467 2.02486 16.6565 2.39363 16 3.05004C15.5785 2.61965 15.053 2.30534 14.4744 2.13754C13.8959 1.96974 13.2838 1.95412 12.6974 2.09219C12.111 2.23027 11.5701 2.51736 11.1272 2.9257C10.6843 3.33403 10.3542 3.84978 10.169 4.42304C9.5899 4.10852 8.93371 3.96391 8.27601 4.00584C7.6183 4.04778 6.9858 4.27456 6.45128 4.66009C5.91677 5.04561 5.50197 5.57422 5.2546 6.18508C5.00724 6.79594 4.93738 7.46423 5.05305 8.11304C4.4233 8.2664 3.84026 8.5705 3.3541 8.99915C2.86794 9.4278 2.49323 9.96818 2.26222 10.5738C2.0312 11.1793 1.9508 11.832 2.02794 12.4755C2.10508 13.1191 2.33745 13.7342 2.70505 14.268C3.49905 15.42 4.40905 16.712 4.20005 18.1C3.92605 19.743 3.01405 20.732 2.00005 22ZM2.00005 22L17 7"
                      stroke="#11D600" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
                  </svg>
                </span>
              </div>
              <span>حديقة</span>
            </div>
            <div>
              <div class="options-card3">
                <span>
                  <svg width="22" height="24" viewBox="0 0 22 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M7.32007 15C8.44121 14.3608 9.70951 14.0246 11.0001 14.0246C12.2906 14.0246 13.5589 14.3608 14.6801 15M5.20996 11.54C6.97615 10.541 8.97079 10.0159 11 10.0159C13.0291 10.0159 15.0238 10.541 16.79 11.54M3.1001 8.09009C5.50473 6.71251 8.22749 5.98691 10.9988 5.98516C13.77 5.98341 16.4937 6.70555 18.9001 8.08009M1 4.62988C4.04561 2.89003 7.49246 1.9749 11 1.9749C14.5075 1.9749 17.9544 2.89003 21 4.62988"
                      stroke="#EE2737" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
                  </svg>
                </span>
              </div>
              <span>انترنت</span>
            </div>
            <div>
              <div class="options-card4">
                <span>
                  <img src="/images/Group.svg" alt="" />
                </span>
              </div>
              <span>مكيف</span>
            </div>
          </div>
        </div>
      </div>
    </div>

  </div>
</template>

<script>
import Map from '../Home/Map.vue'
export default {
  components: {
      Map
    },
  data() {
    
    return {
      isSoroVisible: false
    };
  },
  methods: {
    toggleSoro() {
      this.isSoroVisible = !this.isSoroVisible;
    }
  }
}
</script>

<style>
.place-img {
  border-radius: 20px;
  overflow: hidden;
  position: relative;

}

.place-img img {
  width: 100%;
  height: 350px;
}

.catigory-span {
  position: absolute;
  top: 20px;
  right: 20px;
  padding: 7px 30px;
  border-radius: 10px;
}

.small-img-parent {
  position: absolute;
  bottom: 0;
}

.small-image {
  padding: 10px;
}

.small-image img {
  width: 60px;
  height: 60px;
}

.card-deatails {
  font-size: 16px;
}

.responsive-map2 {
  overflow: hidden;
  position: relative;
  height: 300px;
}

.responsive-map2 iframe {
  left: 0;
  top: 0;
  height: 100%;
  width: 100%;
  position: absolute;
  border-radius: 20px;
  z-index: 1;
}

.overlay-info {
  background-color: white;
  position: absolute;
  top: 10px;
  right: 10px;
  z-index: 12;
}

.overlay-info a {
  text-decoration: none;
}

.chat-circle {
  color: white;
  background-color: var(--blue);
  width: 70px;
  height: 70px;
  border-radius: 50%;
  line-height: 20px;
  text-align: center;
  position: absolute;
  bottom: 20px;
  right: 20px;
  padding: 5px;
  cursor: pointer;
}

.chat-circle span {
  font-size: 12px;
}

.chats-box {

  background-color: white;
  width: 500px;
  height: 250px;
  text-align: center;
  position: absolute;
  bottom: 100px;
  right: 20px;
  padding: 10px;
  box-shadow: 0px 5px 25px 0px #0000001A;
  border-radius: 10px;
  overflow-y: scroll;
  z-index: 10;
}


@media only screen and (max-width: 600px) {
  .chats-box {

    width: 90%;
    height: 250px;

    position: absolute;
    bottom: 100px;
    right: 20px;

    z-index: 10;
  }

  .resopnsive-p {
    font-size: 12px;
  }
}
</style>